In [14]:
import pandas as pd

In [26]:
df = pd.read_csv('student_details.csv')

In [27]:
df

,Unnamed: 0,Student_ID,Name,Class,Section,Roll,DOB,Address,Contact,Email,Date Joined
0,0,77777,Mr. Human,12,E,99,2006,Butwal,999999999,mr.human@gmail.com,2020
1,1,116,Sanjay,8,E,13,2005,Butwal,999999999,johndoe@gmail.com,2022

In [31]:
del df['Unnamed: 0']

In [32]:
df

,Student_ID,Name,Class,Section,Roll,DOB,Address,Contact,Email,Date Joined
0,77777,Mr. Human,12,E,99,2006,Butwal,999999999,mr.human@gmail.com,2020
1,116,Sanjay,8,E,13,2005,Butwal,999999999,johndoe@gmail.com,2022

In [24]:
df.to_csv('student_details.csv')